{
  "楷书": [
    {
      "key": "知识背景",
      "value": "楷书，汉字的一种字体，也叫楷体、正楷、真书、正书。由隶书逐渐演变而来，更趋简化，横平竖直。《辞海》书中解释说它“形体方正，笔画平直，可作楷模”。这种汉字字体端正，就是现代通行的汉字手写正体字。楷书也是一种官名。《新唐书·百官志二》书中记中书省史馆有楷书二十人，写国史楷书十八人。楷书作为官名也称作楷书手，掌缮写之事，在同一机构中并置，因具体分工有所不同。《通典·职官二十二》记楷书手为流外勋品官。宋代无楷书手之称，惟称楷书。"
    },
    {
      "key": "基本信息",
      "value": "楷书也叫正楷、真书、正书。从程邈创立的隶书逐渐演变而来，更趋简化，横平竖直。《辞海》解释说它“形体方正，笔画平直，可作楷模。”故名楷书。始于汉末，通行至现代，长盛不衰。楷书的产生，紧扣汉隶的规矩法度，而追求形体美的进一步发展，汉末、三国时期，汉字的书写逐渐变波、磔而为撇、捺、且有了“侧”（点）、“掠”（长撇）、“啄”（短撇）、“提”（直 钩）等笔画，使结构上更趋严整。如《武威医简》、《居延汉简》等。楷书的特点在于规矩整齐，是字体中的楷模，所以称为楷书，一直沿用至现代。楷书有楷模的意思，张怀瓘《书断》中已先谈到过。六朝人仍习惯地用着它，例如羊欣《采》文，王僧虔《论书·韦诞传》中云：“诞字仲将，京兆人，善楷书。”那是“八分楷法”的简称。到北宋才以之代替了正书之名，其内容显然和古称是不一样的，名异实同和名同实异之例，大概有以上这些。楷书是我国封建社会南北魏到晋唐最为流行的一种书体。在楷书产生之前，我国的书法已产生了大篆、小篆和隶书三种书体。大篆是相对小篆而言的，一般把小篆以前所有的古文字统称为大篆，包括甲骨文、金文和战国时期除秦国之外的六国文字。小篆是秦统一中国之后通行的文字，它是以秦国的文字为基础，参照其他诸侯国文字，为便于书写而删繁就简、规范统一的，这是中国书法史上最初的规范化书体。"
    },
    {
      "key": "演变过程",
      "value": "如今一般所说的楷书，是从汉隶逐渐演变而来的，按照时期划分，可分为魏碑和唐楷。魏碑是指魏、晋、南北朝时期的书体，它可以说是一种从隶书到楷书的过渡书体，钟致帅《雪轩书品》称：“魏碑书法，上可窥汉秦旧范，下能察隋唐习风。”魏碑经常带有汉朝隶书的写法在其中，因此它的楷书性质还不成熟，但正因为这种不成熟性，也就造成了百花齐放的场面，意态奇异，形成了一种独特的美，康有为评价有“魏碑十美”。而狭义的楷书则是指到唐朝以后逐渐成熟起来的唐楷，其代表人物有初唐的欧阳询、虞世南、褚遂良、薛稷，中唐的颜真卿，晚唐的柳公权。我们常说的楷书四大家“颜柳欧赵”，前三个就在唐朝。到了唐末，楷书已发展到了顶峰，风格已过于规整，于是逐渐走下坡路了。但是“唐书重法，宋书重意”，宋朝的苏轼以其诗人的风度开创了丰腴跌宕、天真烂漫的“苏体”，堪称“宋朝第一”。宋末元初的赵孟頫，以其恬润、婉畅，形成了“赵体”，也就是四大家中的“赵”，但是“赵体”严格来讲应该属于行楷，不再是规规矩矩的楷书了，所以初学者一般从“颜柳欧”三体择一入手，这也被公认为学书之正路。下面我将这三体从多个角度作一对比，有的角度还参考了魏碑和赵体，为的是能够全面的认识楷书个体。以上重点对比了“颜柳欧”三体的风格与特点，这里面既有时代的影响，又有个人的因素，如欧体形成于初唐，受魏碑的影响较大；颜体受唐朝以肥为美的审美观点的影响，又较丰腴；而柳体由于柳公权为人正直，“人正则字正”。"
    },
    {
      "key": "字体分类",
      "value": "1~3厘米的为小楷(小字)，5厘米以上的为大楷(大字)，之间的为中楷。但这仅仅是笼统的分法，实际上，现实生活里很少出现过小于1厘米的小字和大到1.8米的大字。"
    },
    {
      "key": "书体",
      "value": "【唐】欧阳询（欧体）【唐】颜真卿（颜体）【唐】柳公权（柳体）【元】赵孟頫（赵体）"
    },
    {
      "key": "特点",
      "value": ""
    }
  ],
  "行书": [
    {
      "key": "知识背景",
      "value": "行书，是一种书法统称，分为行楷和行草两种。它在楷书的基础上发展起源的，是介于楷书、草书之间的一种字体，是为了弥补楷书的书写速度太慢和草书的难于辨认而产生的。“行”是“行走”的意思，因此它不像草书那样潦草，也不像楷书那样端正。实质上它是楷书的草化或草书的楷化。楷法多于草法的叫“行楷”，草法多于楷法的叫“行草”。行书实用性和艺术性皆高，而楷书是文字符号，实用性高且见功夫；相比较而言，草书则是艺术性高，但是实用性显得相对不足。"
    },
    {
      "key": "基本信息",
      "value": "行书出现的时间大约同八分楷法差不多，而其形式也和八分楷法及以后的正书非常接近。这相当于从隶书中变出（章）草书——由“正体字”中派生出别支来。桓灵朝的“正体字”除了隶书以外，其次就是“八分楷法”，所以人们又认为行书就是“八分楷法”的别支。其实它也是同其他书体一样最初的创始还是一般的群众书写者，只要把八分书写得同其他书法流走一些而去其隶体波势，就变成行书了，在汉末一般出土的简书中我们是可以随处看到的。在汉末，行书没有普遍地应用。直至晋朝王羲之的出现，才使之盛行起来。行书到王羲之手中，将它的实用性和艺术性结合起来。从而创立了光照千古的南派行书艺术，成为书法史上影响最大的一宗。北京大学教授、引碑入草开创者李志敏评价：“王羲之的书法既表现以老庄哲学为基础的简淡玄远，又表现以儒家的中庸之道为基础的冲和。”南宋姜夔《续书谱·行书》曰:“尝夷考魏、晋行书，自有一体，与草书不同。大率变真，以便于挥运而已。草出于章，‘行出于真，虽曰行书，各有定体，纵复晋代诸贤，亦苦不相远。’《兰亭序》及右军诸帖第一，谢安石、大令诸帖次之，颜、柳、苏、米，亦后世之可观者。大要以笔老为贵，少有失误，亦可辉映。所贵乎稼纤间出，血脉相连，筋骨老健，风神洒落，姿态备具，真有真之态度，行有行之态度，草有草之态度。必须博习，可以兼通。”按语：行书结字必须具之动势。方法一，加大横、竖画的倾斜度，增强整个字的动势；二把方形的字倾斜成斜边形，从险势中增强字的动势；三采用倚正相依手法，使字体活泼稳定又不东倒西歪；四采用虚实对比手法，使字体取得动而平衡的要求。除此以外，还要注意字的大小、布白、虚实、粗细、枯润变化及其用笔特点，这样写出来的行书自然会有动势。同时由于行书运笔的节奏比较快，所以要特别注意笔调的沉着功夫，要纵得出，擒得定，拓得开，留得住。切忌流滑而犯尖薄虚浮之病，特别是写长撇、悬针等出锋之笔，收笔时要尖锐饱满，富有力度和余势，不可势尽力竭，打头鼠尾满纸皆是，作虚尖飘忽之状。"
    },
    {
      "key": "演变过程",
      "value": "行书是介于楷书与草书之间的一种书体，大约出现于东汉末年。行书的名称始见于西晋卫恒《四体书势》一文：“魏初，有钟（繇）、胡（昭）二家为行书法，俱学之于刘德升。”唐代张怀瓘《书断》记载：“行书者，刘德升所作也。即正书之小伪，务从简易，相间流行，故谓之行书。”张怀瓘在其《书议》又云：“夫行书非草非真，离方遁圆，在乎季孟之间，兼真者谓之真行，带草者谓之行草。”明代丰坊在《书诀》中则有更为形象的描述：“行笔而不停，著纸而不刻，轻转重按，如水流云行，无少间断，永存乎生意也。”行书正因其行云流水、书写快捷、飘逸易识的特有艺术表现力和宽广的实用性，从产生起便受到欢迎，广泛传播。行书历经魏晋的黄金期、唐代的发展期后，在宋代达到了新的高峰，于各种书体中逐渐占居主流地位。纵观漫长的书史，篆书、隶书、楷书的发展都存在盛衰的变化，而行书则长盛不衰，始终是书法领域的显学。历代书法大家共同书写了行书发展辉煌灿烂的历史。随着当代书法艺术的蓬勃发展，行书创作的探索与创新掀起了一波又一波热潮，呈现出多元激荡的繁荣景象。在繁杂的书法热浪中，笔者以自己对书法的理解和执著追求，理性地摸索，从多年的躬耕实践中总结了一些初步的体验与感悟。在浩如烟海的书法艺术宝库中，行书无疑是一座最为绚烂多姿、丰富厚重的宝藏。其中王羲之创作了被誉为“天下第一行书”的《兰亭序》，颜真卿创作了“天下第二行书”《祭侄文稿》，苏轼创作了“天下第三行书”《寒食帖》，王珣创作了《伯远帖》，王献之创作了《鸭头丸帖》等。这些照亮书法艺术星空的经典之作，是历经漫长岁月淘洗留下的艺术精髓，是中华民族对人类审美领域的独特贡献。"
    },
    {
      "key": "字体分类",
      "value": ""
    },
    {
      "key": "书体",
      "value": "唐代颜真卿，宋代苏轼、黄庭坚、米芾，蔡襄，元代的赵孟頫、鲜于枢、康里巎巎，明代的祝允明、文徵明、董其昌、李待问、王铎，清代的刘墉、何绍基，近现代的于右任、启功、李志敏、沙孟海、张辛等"
    },
    {
      "key": "特点",
      "value": "行云流水 大小相兼 书写速度快"
    }
  ],
  "隶书": [
    {
      "key": "知识背景",
      "value": "隶书，汉字的一种字体，有秦隶、汉隶等，一般认为由篆书发展而来，字形多呈宽扁，横画长而竖画短，讲究“蚕头燕尾”、“一波三折”。根据出土简牍，隶书始创于秦朝，传说程邈作隶，汉隶在东汉时期达到顶峰，上承篆书传统，下开魏晋、南北朝，对后世书法有不可小觑的影响，书法界有“汉隶唐楷”之称。"
    },
    {
      "key": "基本信息",
      "value": "关于隶书的定义，近人吴伯陶先生一篇：《从出土秦简帛书看秦汉早期隶书》的文章中说道：“可以用这个字的本义来作解释。〈说文解字〉中解释‘隶’的意义是‘附着’，〈后汉书·冯异传〉则训为‘属’，这一意义到今天还在使用，现代汉语中就有‘隶属’一词。〈晋书·卫恒传〉、〈说文解字序〉及段注，也都认为隶书是‘佐助篆所不逮’的，所以隶书是小篆的一种辅助字体。”"
    },
    {
      "key": "演变过程",
      "value": "隶书者，篆之捷也。这是西晋·卫恒《四体书势》对隶书本体及其产生背景的经典叙述。事实上，篆之捷是指在春秋战国时期的篆书字体体系中发生结构和书写性变化（隶变），并经漫长的“隶变”过程而形成的一种新的相对独立的字体。也就是说，隶书是通过“隶变”从篆书字体中脱胎产生的。隶变在中国书法史上是一次重大的书法文化事件。发生隶变的内在动因是为了适应当时社会发展对文字应用的要求。“隶变主要表现在两个方面：一是字形结构的变化，既是对正体篆书字形结构的改造，这种改造的主要方向是简化；二是书写方式的变化，既是改变原有正体篆书的书写方式，这种改变的主要目的是简捷流便”。字形结构的简化和书写方式的简捷流便构成了隶变过程的核心内容。在这里，字形结构的简化和书写方式的简捷流便，不光为了书写速度的提高，同时因其蕴涵着内在的书写运动态势更加符合人的生理运动轨迹，才使隶书在秦汉之交随着政治的更替最终彻底代替篆书而获得普遍应用的。"
    },
    {
      "key": "字体分类",
      "value": "秦隶、汉隶"
    },
    {
      "key": "书体",
      "value": "其中一郑簠，金农，邓石如，伊秉绶为代表。"
    },
    {
      "key": "特点",
      "value": "隶书是从篆书发展而来的，隶书是篆书的化繁为简，化圆为方，化弧为直。"
    }
  ]
}
